.planning/case_profiles/case_024_v64_val_full_4_cavity_dicts/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Web:      www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// case_024 · Lid-Driven Cavity · 2D · 129 × 129 × 1 = 16,641 cells
// Domain: x ∈ [0, 1] m  ·  y ∈ [0, 1] m  ·  z ∈ [0, 0.01] m (single layer)
// Lid (y=1): moving wall U=(1, 0, 0)
// Bottom (y=0) + Left (x=0) + Right (x=1): no-slip walls
// Front/Back (z=0, z=0.01): empty (2D)
// Grading: simpleGrading (1 1 1) — uniform Cartesian; matches Ghia 1982 §3 baseline grid
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 1;

vertices
(
    (0   0   0   )   // 0  bottom-left  back
    (1   0   0   )   // 1  bottom-right back
    (1   1   0   )   // 2  top-right    back
    (0   1   0   )   // 3  top-left     back
    (0   0   0.01)   // 4  bottom-left  front
    (1   0   0.01)   // 5  bottom-right front
    (1   1   0.01)   // 6  top-right    front
    (0   1   0.01)   // 7  top-left     front
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (129 129 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    lid
    {
        type wall;
        faces
        (
            (3 2 6 7)   // top face: y = 1
        );
    }
    walls_fixed
    {
        type wall;
        faces
        (
            (0 4 5 1)   // bottom: y = 0
            (0 3 7 4)   // left:   x = 0
            (1 5 6 2)   // right:  x = 1
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 1 2 3)   // back:  z = 0
            (4 7 6 5)   // front: z = 0.01
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
