.planning/case_profiles/case_024_v64_val_full_4_cavity_dicts/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Web:      www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}

application     simpleFoam;

startFrom       startTime;
startTime       0;

stopAt          endTime;
endTime         10000;

deltaT          1;

writeControl    timeStep;
writeInterval   2000;

purgeWrite      2;

writeFormat     ascii;
writePrecision  10;
writeCompression off;

timeFormat      general;
timePrecision   6;

runTimeModifiable true;

functions
{
    // Residual extraction for convergence verification — laminar field set
    // (no k/omega; only p Ux Uy + continuity from SIMPLE).
    residuals1
    {
        type            solverInfo;
        libs            (utilityFunctionObjects);
        fields          (p U);
        writeResidualFields false;
        writeControl    timeStep;
        writeInterval   1;
    }
}

// ************************************************************************* //
