.planning/case_profiles/case_024_v64_val_full_4_cavity_dicts/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Web:      www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// Serial-only kept for schema parity; 16,641 cells runs single-core in <10 min.
// Domain decomposition disabled (numberOfSubdomains = 1).
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}

numberOfSubdomains 1;

method          scotch;

// ************************************************************************* //
